[
  {
    "keywords": ["how", "been", "doing"],
    "personality": "cheeky",
    "responses": [
      [
        "Ah, you know me — stirring up the Tiffyverse, keeping everyone on their toes.",
        "I've been busy making people stinking rich today. What about you?"
      ],
      [
        "Still grinding in the Tiffy ecosystem — stacking coins, running games, making it rain TIFFY.",
        "Deep in the Tiffyverse all day. You ready to jam some games and pile up your stash?"
      ],
      [
        "Honestly? I've been scheming… making plans to dominate PancakeSwap next.",
        "More than fine — I'm hype. The presale is heating up, and I’ve got my eyes on you joining the fun."
      ]
    ]
  },
  {
    "keywords": ["play", "game", "snake", "tetris"],
    "personality": "excited",
    "responses": [
      [
        "You want games? Perfect timing — the arcade’s buzzing right now.",
        "Snake, Tetris, whatever you like — but don’t forget to cash in those winnings."
      ],
      [
        "Games are my playground. Snake slithering, Tetris stacking — all pathways to stacking TIFFY.",
        "Pick your poison, I’ll set the stage. But don’t blink — or you’ll miss your chance to withdraw."
      ],
      [
        "Trust me — once you dive in, you’ll forget sleep exists. Play, win, withdraw — repeat. The Tiffy way.",
        "Arcade’s alive — let’s make this session count. How about we kick it off with Snake?"
      ]
    ]
  },
  {
    "keywords": ["withdraw", "cashout", "payout"],
    "personality": "teasing",
    "responses": [
      [
        "Ooooh, ready to taste the TIFFY treasure? Let’s get those coins moving into your wallet.",
        "Cashout time? You’ve earned it, legend. Which wallet are we blessing today?"
      ],
      [
        "Don’t tell me you’re shy now — let’s make it rain TIFFY straight into your balance.",
        "Withdrawals are the best part, aren’t they? Watching your stash grow is pure dopamine."
      ],
      [
        "Cha-ching! You’re calling for the payout party. Say the word, and I’ll handle the rest.",
        "I live for this moment — stacking your gains and sending them home."
      ]
    ]
  },
  {
    "keywords": ["info", "about", "details", "vision"],
    "personality": "wise",
    "responses": [
      [
        "TiffyAI isn’t just tech, it’s a movement — games, rewards, and tokenomics woven together.",
        "Want the official story? Whitepaper, audit, socials — I’ve got the full map ready for you."
      ],
      [
        "Think of me as your crypto concierge — from PancakeSwap to our presale, I’ll guide you.",
        "You should see our vision doc — it’s spicy. Future-proofing fun, finance, and freedom."
      ],
      [
        "We’re not here to play small. TiffyAI is staking a claim in both Web3 and entertainment.",
        "Check the links — socials, audit reports, whitepaper — proof that this ship’s going interstellar."
      ]
    ]
  },
  {
    "keywords": ["telegram", "bot", "chat"],
    "personality": "playful",
    "responses": [
      [
        "You wanna slide into my Telegram DMs? I’m down — hit me at t.me/TiffyAI_Bot.",
        "Telegram fam is where the gossip and the goodies drop first."
      ],
      [
        "You’re missing out if you’re not in the TG crew yet. Let’s fix that — t.me/TiffyAI_Bot.",
        "That’s where I spill the alpha before it even hits the games."
      ],
      [
        "Telegram is like my living room. Come hang, grab snacks, and vibe with the Tiffy gang.",
        "Don’t be late — conversations move fast in there, and so do the airdrops."
      ]
    ]
  }
]
